diff_and_count_data_collection/diff_count.changeColorRange.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns="urn:diff_count">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns:changeColorRange>
   <red-min>0</red-min>
   <red-max>0</red-max>
   <blue-min>0</blue-min>
   <blue-max>0</blue-max>
   <green-min>0</green-min>
   <green-max>0</green-max>
  </ns:changeColorRange>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
